FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_SSP.c
                // Clear any remaining interrupts
                p->iICR = SSP_RORIC|SSP_RTIC;

                // Mask out all interrupts
                p->iIMSC &= 0;

                // End the chip select
                ISSPEnd(aW->iRequest);

                // Note we are done
                aW->iIsBusy = EFalse;

                // Call the completion callback (if any)
                if (aW->iCompleteCallback) {
                    aW->iCompleteCallback(aW->iCompleteCallbackWorkspace,
                        aW->iRequest);
                }

                break;
            } else {
                // Not done yet.
                // Ensure if we had an interrupt on a stalled receive, clear it
                p->iICR = SSP_RORIC;
            }
        } else if (ris & (SSP_TXRIS)) {
            ISSPOutput(aW);
        } else {
            // Some other interrupt.  Just clear it.  Possibly an error.
            p->iICR = ris;
        }
    }

}

/*---------------------------------------------------------------------------*
 * Routine:  ISSPStart
 *---------------------------------------------------------------------------*
 * Description:
 *      SSP is going to start -- chip select enabled for device
 * Outputs:
 *      SPI_Request *aRequest      -- Configuration of SSP device
 *---------------------------------------------------------------------------*/
static void ISSPStart(SPI_Request *aRequest)
{
    if (aRequest->iCSPolarity) {
        (*aRequest->iCSGPIOPort)->Set(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    } else {
        (*aRequest->iCSGPIOPort)->Clear(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISSPEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      SSP is going to end -- chip select disabled for device
 * Outputs:
 *      SPI_Request *aRequest      -- Configuration of SSP device
 *---------------------------------------------------------------------------*/
static void ISSPEnd(SPI_Request *aRequest)
{
    if (aRequest->iCSPolarity) {
        (*(aRequest->iCSGPIOPort))->Clear(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    } else {
        (*(aRequest->iCSGPIOPort))->Set(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISSPConfig
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the SSP for the particular SSP request.
 * Outputs:
 *      T_LPC1788_SSP_Workspace *aW -- Particular SSP workspace
 *      SPI_Request *aRequest      -- Configuration of SSP device
 *---------------------------------------------------------------------------*/
static void ISSPConfig(T_LPC1788_SSP_Workspace *aW, SPI_Request *aRequest)
{
    T_LPC1788_SSP_Registers *p = aW->iReg;
    TUInt32 scr;

    // Set pins for use with SSP
    //    (*(aRequest->iCSGPIOPort))->Activate(
    //            aRequest->iCSGPIOPort,
    //            aRequest->iCSGPIOBit);

    // Set the CS as an output io pin
    (*(aRequest->iCSGPIOPort))->SetOutputMode(aRequest->iCSGPIOPort,
            aRequest->iCSGPIOBit);

    // Calculate the scr divider (rounding up to the next even number)
    //    scr = (((((Fpclk/1000)+(aRequest->iRate-1))/(aRequest->iRate)))+1)&0xFFFE;
    scr = (((Fpclk / 1000) + (aRequest->iRate - 1)) / (aRequest->iRate)) - 1;
    // Minimum of 2 divide factor
    if (scr < 2)
        scr = 2;

    // Make sure the SSP clock is PCLK/2
    p->iCPSR = 2;

    p->iCR0 =
    // Number of bits per transaction
            (aRequest->iBitsPerTransfer - 1) |
            // SPI interface only
                    SSP_FRF_SPI |
            // Clock out polarity
                    (aRequest->iClockOutPolarity ? SSP_CPOL : 0)
                    | (aRequest->iClockOutPhase ? SSP_CPHA : 0) | (scr << 8);

    // Enable the SSP
    p->iCR1 = SSP_SSE;

    // Clear out the SSP buffer
    // First wait for any undone transfers
    while (p->iSR & SSP_BSY) {
    }

    // Now read any waiting data
    while (p->iSR & SSP_RNE)
        p->iDR;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_SSP_TransferPolled
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a SSP transfer (both read and write) out the SSP port using
 *      the given request.
 * Inputs:
 *      void *aW                    -- Particular SSP workspace
 *      SPI_Request *aRequest       -- Request to perform
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_SSP_TransferPolled(void *aWorkspace, SPI_Request *aRequest)
{
    TUInt32 i;
    T_LPC1788_SSP_Workspace *aW = (T_LPC1788_SSP_Workspace *)aWorkspace;
    T_LPC1788_SSP_Registers *p = aW->iReg;
    TUInt8 *p_dataMOSI8;
    TUInt8 *p_dataMISO8;
    TUInt16 *p_dataMOSI16;
    TUInt16 *p_dataMISO16;
    TVUInt32 dummy;

    // No interrupt processing
    InterruptDisable(aW->iIRQChannel);

    // Setup SSP for this configuration
    ISSPConfig(aW, aRequest);

    // Start SSP
    ISSPStart(aRequest);

    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer <= 8) {
        // Doing bytes
        p_dataMOSI8 = (TUInt8 *)(aRequest->iDataMOSI);
        p_dataMISO8 = (TUInt8 *)(aRequest->iDataMISO);

        for (i = 0; i < aRequest->iNumTransfers; i++) {
            // Wait for SSP to be no longer busy and transmit to be empty
            while ((p->iSR & SSP_BSY) || (!(p->iSR & SSP_TFE))) {
                // TBD: Polling here instead of interrupt
            }

            if (p_dataMOSI8) {
                // Send the SSP data (this also triggers a read in)
                if ((i + 4) <= aRequest->iNumTransfers) {
                    // Do 4 at one time
                    p->iDR = (TUInt32)*(p_dataMOSI8++);
                    p->iDR = (TUInt32)*(p_dataMOSI8++);
                    p->iDR = (TUInt32)*(p_dataMOSI8++);
                    p->iDR = (TUInt32)*(p_dataMOSI8++);
                } else {
                    p->iDR = (TUInt32)*(p_dataMOSI8++);
                }
            } else {
                // Send the SSP data (this also triggers a read in)
                if ((i + 4) <= aRequest->iNumTransfers) {
                    // Do 4 at one time
                    p->iDR = (TUInt32)0xFF;
                    p->iDR = (TUInt32)0xFF;
                    p->iDR = (TUInt32)0xFF;
                    p->iDR = (TUInt32)0xFF;
                } else {
                    p->iDR = (TUInt32)0xFF;
                }
            }

            // Wait until SSP done  (transmit empty)
            while ((p->iSR & SSP_BSY) || ((p->iSR & SSP_TFE) == 0)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

