FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_SSP.c
static T_uezError LPC1788_SSP_TransferNoBlock(
        void *aWorkspace,
        SPI_Request *aRequest,
        T_spiCompleteCallback aCallback,
        void *aCallbackWorkspace)
{
    T_LPC1788_SSP_Workspace *aW = (T_LPC1788_SSP_Workspace *)aWorkspace;
    T_LPC1788_SSP_Registers *p = aW->iReg;

    // This routine only works with transfer of 8 bits or lower
    if (aRequest->iBitsPerTransfer > 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Disable any potential SSP interrupts
    InterruptDisable(aW->iIRQChannel);

    aRequest->iNumTransferredOut = 0;
    aRequest->iNumTransferredIn = 0;

    // Setup the callback and the parameters
    aW->iCompleteCallback = aCallback;
    aW->iCompleteCallbackWorkspace = aCallbackWorkspace;
    aW->iRequest = aRequest;

    // Setup SSP for this configuration
    ISSPConfig(aW, aRequest);

    // Start SSP
    ISSPStart(aRequest);

    // Note we are in the middle of a transaction
    aW->iIsBusy = ETrue;

    // Allow receive half full, receive idle, and transmit half empty interrupts
    p->iIMSC = SSP_RTIM|SSP_RXIM|SSP_TXIM;

    // Prime the pump and output in an amount of data
    // On interrupting, we'll feed in the data
    ISSPOutput(aW);

    // Now allow processing of the interrupts (which probably just occurred)
    InterruptEnable(aW->iIRQChannel);

    return UEZ_ERROR_NONE;
}

static TBool LPC1788_SSP_IsBusy(void *aWorkspace)
{
    T_LPC1788_SSP_Workspace *aW = (T_LPC1788_SSP_Workspace *)aWorkspace;

    return aW->iIsBusy;
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SPI SSP_LPC1788_Port0_Interface = {
        {
        "NXP:LPC1788:SSP0",
        0x0202,
        LPC1788_SSP_SSP0_InitializeWorkspace,
        sizeof(T_LPC1788_SSP_Workspace),
        },

        LPC1788_SSP_TransferPolled,

        LPC1788_SSP_Start,
        LPC1788_SSP_TransferInOut,
        LPC1788_SSP_Stop,
        LPC1788_SSP_TransferInOutBytes,

        // uEZ v2.02
        LPC1788_SSP_TransferNoBlock,
        LPC1788_SSP_IsBusy,
};

// TODO: Add to other SSP's too!
const HAL_SPI SSP_LPC1788_Port1_Interface = {
        {
        "NXP:LPC1788:SSP1",
        0x0202,
        LPC1788_SSP_SSP1_InitializeWorkspace,
        sizeof(T_LPC1788_SSP_Workspace),
        },

        LPC1788_SSP_TransferPolled,

        LPC1788_SSP_Start,
        LPC1788_SSP_TransferInOut,
        LPC1788_SSP_Stop,
        LPC1788_SSP_TransferInOutBytes,

        // uEZ v2.02
        LPC1788_SSP_TransferNoBlock,
        LPC1788_SSP_IsBusy,
};

const HAL_SPI SSP_LPC1788_Port2_Interface = {
        {
        "NXP:LPC1788:SSP2",
        0x0202,
        LPC1788_SSP_SSP2_InitializeWorkspace,
        sizeof(T_LPC1788_SSP_Workspace),
        },

        LPC1788_SSP_TransferPolled,

        LPC1788_SSP_Start,
        LPC1788_SSP_TransferInOut,
        LPC1788_SSP_Stop,
        LPC1788_SSP_TransferInOutBytes,

        // uEZ v2.02
        LPC1788_SSP_TransferNoBlock,
        LPC1788_SSP_IsBusy,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_SSP0_Require(
        T_uezGPIOPortPin aPinSCK0,
        T_uezGPIOPortPin aPinMISO0,
        T_uezGPIOPortPin aPinMOSI0,
        T_uezGPIOPortPin aPinSSEL0)
{
    static const T_LPC1788_IOCON_ConfigList sck0[] = {
            {GPIO_P0_15, IOCON_D_DEFAULT(2)},
            {GPIO_P1_20, IOCON_D_DEFAULT(5)},
            {GPIO_P2_22, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList ssel0[] = {
            {GPIO_P0_16, IOCON_D_DEFAULT(2)},
            {GPIO_P1_21, IOCON_D_DEFAULT(3)},
            {GPIO_P1_28, IOCON_D_DEFAULT(5)},
            {GPIO_P2_23, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList miso0[] = {
            {GPIO_P0_17, IOCON_D_DEFAULT(2)},
            {GPIO_P1_23, IOCON_D_DEFAULT(5)},
            {GPIO_P2_26, IOCON_D_DEFAULT(2)},
    };
    static const T_LPC1788_IOCON_ConfigList mosi0[] = {
            {GPIO_P0_18, IOCON_D_DEFAULT(2)},
            {GPIO_P1_24, IOCON_D_DEFAULT(5)},
            {GPIO_P2_27, IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register SSP0
    HALInterfaceRegister("SSP0",
            (T_halInterface *)&SSP_LPC1788_Port0_Interface, 0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aPinSCK0, sck0, ARRAY_COUNT(sck0));
    LPC1788_IOCON_ConfigPinOrNone(aPinSSEL0, ssel0, ARRAY_COUNT(ssel0));
    LPC1788_IOCON_ConfigPinOrNone(aPinMISO0, miso0, ARRAY_COUNT(miso0));
    LPC1788_IOCON_ConfigPinOrNone(aPinMOSI0, mosi0, ARRAY_COUNT(mosi0));
    LPC1788PowerOn(1<<21);

    // Setup interrupt, but do not enable
    InterruptRegister(SSP0_IRQn, ISSP0IRQ, INTERRUPT_PRIORITY_HIGH, "SSP0");
    InterruptDisable(SSP0_IRQn);
}

void LPC1788_SSP1_Require(
        T_uezGPIOPortPin aPinSCK1,
        T_uezGPIOPortPin aPinMISO1,
        T_uezGPIOPortPin aPinMOSI1,
        T_uezGPIOPortPin aPinSSEL1)
{
    static const T_LPC1788_IOCON_ConfigList sck1[] = {
            {GPIO_P0_7,  IOCON_W_DEFAULT(2)},
            {GPIO_P1_19, IOCON_D_DEFAULT(5)},
            {GPIO_P1_31, IOCON_A_DEFAULT(2)},
            {GPIO_P4_20, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList ssel1[] = {
            {GPIO_P0_6,  IOCON_D_DEFAULT(2)},
            {GPIO_P0_14, IOCON_D_DEFAULT(2)},
            {GPIO_P4_21, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList miso1[] = {
            {GPIO_P0_8,  IOCON_W_DEFAULT(2)},
            {GPIO_P0_12, IOCON_A_DEFAULT(2)},
            {GPIO_P1_18, IOCON_D_DEFAULT(5)},
            {GPIO_P4_22, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList mosi1[] = {
            {GPIO_P0_9,  IOCON_W_DEFAULT(2)},
            {GPIO_P0_13, IOCON_A_DEFAULT(2)},
            {GPIO_P1_22, IOCON_D_DEFAULT(5)},
            {GPIO_P4_23, IOCON_D_DEFAULT(3)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register SSP1
    HALInterfaceRegister("SSP1",
            (T_halInterface *)&SSP_LPC1788_Port1_Interface, 0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aPinSCK1, sck1, ARRAY_COUNT(sck1));
    LPC1788_IOCON_ConfigPinOrNone(aPinSSEL1, ssel1, ARRAY_COUNT(ssel1));
    LPC1788_IOCON_ConfigPinOrNone(aPinMISO1, miso1, ARRAY_COUNT(miso1));
    LPC1788_IOCON_ConfigPinOrNone(aPinMOSI1, mosi1, ARRAY_COUNT(mosi1));
    LPC1788PowerOn(1<<10);

    // Setup interrupt, but do not enable
    InterruptRegister(SSP1_IRQn, ISSP1IRQ, INTERRUPT_PRIORITY_HIGH, "SSP1");
    InterruptDisable(SSP1_IRQn);
}

void LPC1788_SSP2_Require(
        T_uezGPIOPortPin aPinSCK2,
        T_uezGPIOPortPin aPinMISO2,
        T_uezGPIOPortPin aPinMOSI2,
        T_uezGPIOPortPin aPinSSEL2)
{
    static const T_LPC1788_IOCON_ConfigList sck2[] = {
            {GPIO_P1_0,   IOCON_D_DEFAULT(4)},
    };
    static const T_LPC1788_IOCON_ConfigList ssel2[] = {
            {GPIO_P1_8,   IOCON_D_DEFAULT(4)},
    };
    static const T_LPC1788_IOCON_ConfigList miso2[] = {
            {GPIO_P1_4,   IOCON_D_DEFAULT(4)},
    };
    static const T_LPC1788_IOCON_ConfigList mosi2[] = {
            {GPIO_P1_1,   IOCON_D_DEFAULT(4)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    // Register SSP2
    HALInterfaceRegister("SSP2",
            (T_halInterface *)&SSP_LPC1788_Port2_Interface, 0, 0);
    LPC1788_IOCON_ConfigPinOrNone(aPinSCK2, sck2, ARRAY_COUNT(sck2));
    LPC1788_IOCON_ConfigPinOrNone(aPinSSEL2, ssel2, ARRAY_COUNT(ssel2));
    LPC1788_IOCON_ConfigPinOrNone(aPinMISO2, miso2, ARRAY_COUNT(miso2));
    LPC1788_IOCON_ConfigPinOrNone(aPinMOSI2, mosi2, ARRAY_COUNT(mosi2));
    LPC1788PowerOn(1<<20);

    // Setup interrupt, but do not enable
    InterruptRegister(SSP2_IRQn, ISSP2IRQ, INTERRUPT_PRIORITY_HIGH, "SSP2");
    InterruptDisable(SSP2_IRQn);
}

/*-------------------------------------------------------------------------*
 * End of File:  SSP.c
 *-------------------------------------------------------------------------*/

